In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./datasets/property_data.csv')

In [3]:
df_miss_val = pd.read_csv('./datasets/property_data.csv', na_values=['na', '--'])

PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT

100001000,104,PUTNAM,Y,3,1,1000

100002000,197,LEXINGTON,N,3,1.5,--

100003000,,LEXINGTON,N,n/a,1,850

100004000,201,BERKELEY,12,1,NaN,700

,203,BERKELEY,Y,3,2,1600

100006000,207,BERKELEY,Y,NA,1,800

100007000,NA,WASHINGTON,,2,HURLEY,950

100008000,213,TREMONT,Y,--,1,

100009000,215,TREMONT,Y,na,2,1800

In [4]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [5]:
df_miss_val

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  7 non-null      object
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         8 non-null      object
dtypes: float64(2), object(5)
memory usage: 636.0+ bytes

In [7]:
df_miss_val.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  5 non-null      float64
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         7 non-null      float64
dtypes: float64(4), object(3)
memory usage: 636.0+ bytes

In [8]:
df.isna().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    2
NUM_BATH        1
SQ_FT           1
dtype: int64

##### `result of  total missing values.`

In [9]:
df_miss_val.isna().sum().sum()

11

In [10]:
df_miss_val['ST_NUM'].isna().sum()

2

In [11]:
df_miss_val.isna().any()

PID              True
ST_NUM           True
ST_NAME         False
OWN_OCCUPIED     True
NUM_BEDROOMS     True
NUM_BATH         True
SQ_FT            True
dtype: bool

In [12]:
df_miss_val.nunique()

PID             8
ST_NUM          7
ST_NAME         5
OWN_OCCUPIED    3
NUM_BEDROOMS    3
NUM_BATH        4
SQ_FT           7
dtype: int64

In [14]:
for col in df_miss_val.columns:
  print(f'{col} : {df[col].unique()}')

PID : [1.00001e+08 1.00002e+08 1.00003e+08 1.00004e+08         nan 1.00006e+08
 1.00007e+08 1.00008e+08 1.00009e+08]
ST_NUM : [104. 197.  nan 201. 203. 207. 213. 215.]
ST_NAME : ['PUTNAM' 'LEXINGTON' 'BERKELEY' 'WASHINGTON' 'TREMONT']
OWN_OCCUPIED : ['Y' 'N' '12' nan]
NUM_BEDROOMS : ['3' nan '1' '2' '--' 'na']
NUM_BATH : ['1' '1.5' nan '2' 'HURLEY']
SQ_FT : ['1000' '--' '850' '700' '1600' '800' '950' nan '1800']

In [37]:
cnt = 0
for row in df_miss_val['OWN_OCCUPIED']:  
  try:    # Mencoba mengubah entry menjadi integer    
    int(row)    # Jika berhasil, tandai sebagai NaN    
    df_miss_val.loc[cnt, 'OWN_OCCUPIED'] = np.nan  
  
  except ValueError:    # Jika gagal (entry adalah string), biarkan    
    pass  
  
  cnt += 1

print(df_miss_val)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [38]:
def detect_numeric_as_nan(entry):    
  try:        
    int(entry)        
    return np.nan    
  except ValueError:        
    return entry# Terapkan fungsi pada kolom 'OWN_OCCUPIED'
  
df['OWN_OCCUPIED'] = df['OWN_OCCUPIED'].apply(detect_numeric_as_nan)
print(df)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY          NaN            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [45]:
# df.dropna(axis=1, inplace=True)
ple = df.dropna(axis=1)
ple

      ST_NAME
0      PUTNAM
1   LEXINGTON
2   LEXINGTON
3    BERKELEY
4    BERKELEY
5    BERKELEY
6  WASHINGTON
7     TREMONT
8     TREMONT

In [46]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY          NaN            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

##### `Show all Missing Values in specific Column`

In [41]:
df_miss_val[df_miss_val['NUM_BATH'].isna()]

           PID  ST_NUM   ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH  SQ_FT
3  100004000.0   201.0  BERKELEY          NaN           1.0      NaN  700.0

In [42]:
nba = pd.read_csv('./datasets/nbaallelo.csv')

In [43]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [44]:
nba.shape

(126314, 23)

In [49]:
nba['notes']

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
         ...
126309    NaN
126310    NaN
126311    NaN
126312    NaN
126313    NaN
Name: notes, Length: 126314, dtype: object

In [51]:
nba['notes'].fillna("anjay", inplace=True)
nba['notes']

0         anjay
1         anjay
2         anjay
3         anjay
4         anjay
          ...
126309    anjay
126310    anjay
126311    anjay
126312    anjay
126313    anjay
Name: notes, Length: 126314, dtype: object

In [54]:
nba['notes'].replace("ini","NaN", inplace=True)
nba['notes']

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
         ...
126309    NaN
126310    NaN
126311    NaN
126312    NaN
126313    NaN
Name: notes, Length: 126314, dtype: object

In [55]:
nba.describe()

,gameorder,_iscopy,year_id,seasongame,is_playoffs,pts,elo_i,elo_n,win_equiv,opp_pts,opp_elo_i,opp_elo_n,forecast
count,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000,126314.000000
mean,31579.000000,0.500000,1988.200374,43.533733,0.063857,102.729982,1495.236055,1495.236055,41.707889,102.729982,1495.236055,1495.236055,0.500000
std,18231.927643,0.500002,17.582309,25.375178,0.244499,14.814845,112.139945,112.461687,10.627332,14.814845,112.139945,112.461687,0.215252
min,1.000000,0.000000,1947.000000,1.000000,0.000000,0.000000,1091.644500,1085.774400,10.152501,0.000000,1091.644500,1085.774400,0.020447
25%,15790.000000,0.000000,1975.000000,22.000000,0.000000,93.000000,1417.237975,1416.994900,34.103035,93.000000,1417.237975,1416.994900,0.327989
50%,31579.000000,0.500000,1990.000000,43.000000,0.000000,103.000000,1500.945550,1500.954400,42.113357,103.000000,1500.945550,1500.954400,0.500000
75%,47368.000000,1.000000,2003.000000,65.000000,0.000000,112.000000,1576.060000,1576.291625,49.635328,112.000000,1576.060000,1576.291625,0.672011
max,63157.000000,1.000000,2015.000000,108.000000,1.000000,186.000000,1853.104500,1853.104500,71.112038,186.000000,1853.104500,1853.104500,0.979553

In [56]:
nba.describe(include='object')

,game_id,lg_id,date_game,team_id,fran_id,opp_id,opp_fran,game_location,game_result,notes
count,126314,126314,126314,126314,126314,126314,126314,126314,126314,126314
unique,63157,2,12426,104,53,104,53,3,2,232
top,194611010TRH,NBA,2011-04-13,BOS,Lakers,BOS,Lakers,H,L,NaN
freq,2,118016,30,5997,6024,5997,6024,63138,63157,120890

In [ ]:
# for col in nba.select_dtypes(include='object')

In [57]:
nba[nba['pts'] == 0]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
26684,13343,197210260VIR,ABA,1,1973,1972-10-26,7,0,DNR,Nuggets,...,40.408863,VIR,Squires,2,1484.1907,1487.083,A,L,0.328948,at Richmond VA; forfeit to VIR

In [58]:
nba[(nba["pts"] > nba["opp_pts"]) & (nba["game_result"] != 'W')].empty

True

In [59]:
nba[(nba["pts"] < nba["opp_pts"]) & (nba["game_result"] != 'L')].empty

True

In [60]:
further_city_data = pd.DataFrame(    {"revenue": [7000, 3400], "employee_count": [2, 2]},    index=["New York", "Barcelona"])

further_city_data

           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [ ]:
all_city_data = pd.DataFrame( 
  {"revenue": [4200, 6500, 8000, 3400]},

 )